app/controllers/school_classes_controller.rb

	def update
	  @school_class = @school_classes.find(params[:id])
	  @school_class.update(school_class_params(:title))
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2018-07-17 04:16:36.806598"], ["id", 1]]