app/controllers/students_controller.rb

	def update
	  @student = Student.find(params[:id])
	  @student.update(student_params(:title))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-17 04:07:54.692589"], ["id", 1]]